@echo off
chcp 65001 > nul
cd /d "%~dp0"
title Фильтр трафика
color 0A

echo =================================================================
echo [Система] Запуск фильтрации трафика...
echo =================================================================
echo.

echo ⏳ [1/2] Запуск проверки картинок...
start "SafeView AI" py Nsfw_Filter.py

timeout /t 3 /nobreak > nul

echo.
echo =================================================================
echo 🚀 [2/2] Запуск проверки ссылок...
echo Прокси работает на порту 8080
echo =================================================================
echo.

mitmdump --no-http2 -s gateway_filter.py

pause